In [1]:
import pandas as pd 
import psycopg2

In [2]:
conn = psycopg2.connect(host='localhost',
                        dbname='sql_practice',
                        user='postgres',
                        password='Aujaswi@31',
                        port=5432)
conn.autocommit = True
cur = conn.cursor()

# Question

### Write a query that calculates the difference between the highest salaries found in the marketing and engineering departments. Output just the absolute difference in salaries.

## Creating the table

In [3]:
cur.execute("""CREATE TABLE db_employee (id INT,first_name VARCHAR(50),last_name VARCHAR(50),salary INT,department_id INT);""")

In [4]:
cur.execute("""CREATE TABLE db_dept (id INT,department VARCHAR(50));""")

## Populating the table

In [5]:
cur.execute("""INSERT INTO db_employee (id, first_name, last_name, salary, department_id) VALUES(10306, 'Ashley', 'Li', 28516, 4),(10307, 'Joseph', 'Solomon', 19945, 1),(10311, 'Melissa', 'Holmes', 33575, 1),(10316, 'Beth', 'Torres', 34902, 1),(10317, 'Pamela', 'Rodriguez', 48187, 4),(10320, 'Gregory', 'Cook', 22681, 4),(10324, 'William', 'Brewer', 15947, 1),(10329, 'Christopher', 'Ramos', 37710, 4),(10333, 'Jennifer', 'Blankenship', 13433, 4),(10339, 'Robert', 'Mills', 13188, 1);""")

In [6]:
cur.execute("""INSERT INTO db_dept (id, department) VALUES(1, 'engineering'),(2, 'human resource'),(3, 'operation'),(4, 'marketing');""")

### Solution

In [7]:
cur.execute("""SELECT ABS(
MAX(CASE WHEN d.department = 'engineering' THEN e.salary END)-
MAX(CASE WHEN d.department = 'marketing' THEN e.salary END)) sal_diff
FROM db_employee e
INNER JOIN db_dept d ON e.department_id = d.id;""")

In [8]:
df = pd.DataFrame(cur.fetchall(),columns=['sal_diff'])

In [9]:
df

   sal_diff
0     13285

In [10]:
cur.execute("""SELECT table_name
  FROM information_schema.tables
 WHERE table_schema='public'
   AND table_type='BASE TABLE'""")

In [11]:
tables = cur.fetchall()

In [12]:
for i in tables:
    cur.execute(f"""DROP TABLE {i[0]};""")

In [13]:
cur.close()
conn.close()